
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/17526415175)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 14 to add, 0 to change, 11 to destroy.</code></pre>

* Create
  * module.anime-tweet-bot.github_repository.this[0]
  * module.boilerplate-saas.github_repository.this[0]
  * module.ed-games.github_branch_default.this
  * module.ed-games.github_repository.this_from_template[0]
  * module.ed-games.github_repository_ruleset.this[&#34;main&#34;]
  * module.local-workspace-provisioning.github_repository.this[0]
  * module.obsidian-vault.github_repository.this[0]
  * module.openai-generate-pr-description.github_repository.this[0]
  * module.private-dotfiles.github_repository.this[0]
  * module.renovate-config.github_repository.this[0]
  * module.terraform-aws.github_repository.this[0]
  * module.terraform-github.github_repository.this[0]
  * module.terraform-vercel.github_repository.this[0]
  * module.time-capsule.github_repository.this[0]
* Delete
  * module.anime-tweet-bot.github_repository.this
  * module.boilerplate-saas.github_repository.this
  * module.local-workspace-provisioning.github_repository.this
  * module.obsidian-vault.github_repository.this
  * module.openai-generate-pr-description.github_repository.this
  * module.private-dotfiles.github_repository.this
  * module.renovate-config.github_repository.this
  * module.terraform-aws.github_repository.this
  * module.terraform-github.github_repository.this
  * module.terraform-vercel.github_repository.this
  * module.time-capsule.github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.anime-tweet-bot.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "A bot for tweeting about anime." -> null
      - etag                        = "W/\"c7823f0e1f27aaabe547a8f7171ed08aecc5dddd56a6f9954efcd04b0e3a4191\"" -> null
      - full_name                   = "tqer39/anime-tweet-bot" -> null
      - git_clone_url               = "git://github.com/tqer39/anime-tweet-bot.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/anime-tweet-bot" -> null
      - http_clone_url              = "https://github.com/tqer39/anime-tweet-bot.git" -> null
      - id                          = "anime-tweet-bot" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "anime-tweet-bot" -> null
      - node_id                     = "R_kgDOOYp6NA" -> null
      - primary_language            = "Python" -> null
      - private                     = false -> null
      - repo_id                     = 965376564 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/anime-tweet-bot.git" -> null
      - svn_url                     = "https://github.com/tqer39/anime-tweet-bot" -> null
      - topics                      = [
          - "bot",
          - "x",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }
    }

  # module.anime-tweet-bot.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A bot for tweeting about anime."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "anime-tweet-bot"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "bot",
          + "x",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.blender_chat_character.github_repository.this has moved to module.blender_chat_character.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "blender-chat-character"
        name                        = "blender-chat-character"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.blog.github_repository.this has moved to module.blog.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "blog"
        name                        = "blog"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.boilerplate-base.github_repository.this has moved to module.boilerplate-base.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "boilerplate-base"
        name                        = "boilerplate-base"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.boilerplate-saas.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "A boilerplate for SaaS applications" -> null
      - etag                        = "W/\"96c7be4d7e82be29af7fd8445d47ddf087c1c9f4273d86b35688ebe92e96bfda\"" -> null
      - full_name                   = "tqer39/boilerplate-saas" -> null
      - git_clone_url               = "git://github.com/tqer39/boilerplate-saas.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/boilerplate-saas" -> null
      - http_clone_url              = "https://github.com/tqer39/boilerplate-saas.git" -> null
      - id                          = "boilerplate-saas" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "boilerplate-saas" -> null
      - node_id                     = "R_kgDOOcJkIw" -> null
      - private                     = false -> null
      - repo_id                     = 969040931 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/boilerplate-saas.git" -> null
      - svn_url                     = "https://github.com/tqer39/boilerplate-saas" -> null
      - topics                      = [
          - "boilerplate",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (2 unchanged attributes hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }
    }

  # module.boilerplate-saas.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A boilerplate for SaaS applications"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "boilerplate-saas"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "boilerplate",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.dotfiles.github_repository.this has moved to module.dotfiles.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "dotfiles"
        name                        = "dotfiles"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.ed-games.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "ed-games"
    }

  # module.ed-games.github_repository.this_from_template[0] will be created
  + resource "github_repository" "this_from_template" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Repository generated from boilerplate-base template"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "ed-games"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)

      + template {
          + include_all_branches = false
          + owner                = "tqer39"
          + repository           = "boilerplate-base"
        }
    }

  # module.ed-games.github_repository_ruleset.this["main"] will be created
  + resource "github_repository_ruleset" "this" {
      + enforcement = "active"
      + etag        = (known after apply)
      + id          = (known after apply)
      + name        = "main"
      + node_id     = (known after apply)
      + repository  = "ed-games"
      + ruleset_id  = (known after apply)
      + target      = "branch"

      + bypass_actors {
          + actor_id    = 5
          + actor_type  = "RepositoryRole"
          + bypass_mode = "pull_request"
        }

      + conditions {
          + ref_name {
              + exclude = []
              + include = [
                  + "~DEFAULT_BRANCH",
                ]
            }
        }

      + rules {
          + deletion                      = false
          + non_fast_forward              = false
          + required_linear_history       = true
          + required_signatures           = false
          + update_allows_fetch_and_merge = false

          + pull_request {
              + dismiss_stale_reviews_on_push     = true
              + require_code_owner_review         = false
              + require_last_push_approval        = false
              + required_approving_review_count   = 1
              + required_review_thread_resolution = true
            }
        }
    }

  # module.local-workspace-provisioning.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Local workspace provisioning repository." -> null
      - etag                        = "W/\"8081d8d5e5d05c3758f691b2ed77130d6f465b79ff85f5a66285ba0e6802e2e6\"" -> null
      - full_name                   = "tqer39/local-workspace-provisioning" -> null
      - git_clone_url               = "git://github.com/tqer39/local-workspace-provisioning.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/local-workspace-provisioning" -> null
      - http_clone_url              = "https://github.com/tqer39/local-workspace-provisioning.git" -> null
      - id                          = "local-workspace-provisioning" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "local-workspace-provisioning" -> null
      - node_id                     = "R_kgDONCdstw" -> null
      - primary_language            = "Shell" -> null
      - private                     = false -> null
      - repo_id                     = 874998967 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/local-workspace-provisioning.git" -> null
      - svn_url                     = "https://github.com/tqer39/local-workspace-provisioning" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }
    }

  # module.local-workspace-provisioning.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Local workspace provisioning repository."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "local-workspace-provisioning"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.my-chat-ai-comfyui.github_repository.this has moved to module.my-chat-ai-comfyui.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "my-chat-ai-comfyui"
        name                        = "my-chat-ai-comfyui"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.nana_kana_dialogue_system.github_repository.this has moved to module.nana_kana_dialogue_system.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "nana-kana-dialogue-system"
        name                        = "nana-kana-dialogue-system"
        # (36 unchanged attributes hidden)
    }

  # module.notifications.github_repository.this has moved to module.notifications.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "notifications"
        name                        = "notifications"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.obsidian-vault.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "A repository for managing Obsidian Vault configurations." -> null
      - etag                        = "W/\"7106938fb02c39f31bf56ddaf32da6b3598f07a9e4f0f2757654ef332b145fce\"" -> null
      - full_name                   = "tqer39/obsidian-vault" -> null
      - git_clone_url               = "git://github.com/tqer39/obsidian-vault.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/obsidian-vault" -> null
      - http_clone_url              = "https://github.com/tqer39/obsidian-vault.git" -> null
      - id                          = "obsidian-vault" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "obsidian-vault" -> null
      - node_id                     = "R_kgDOOkfKqQ" -> null
      - private                     = true -> null
      - repo_id                     = 977783465 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/obsidian-vault.git" -> null
      - svn_url                     = "https://github.com/tqer39/obsidian-vault" -> null
      - topics                      = [
          - "docs",
          - "obsidian",
          - "vault",
        ] -> null
      - visibility                  = "private" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.obsidian-vault.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A repository for managing Obsidian Vault configurations."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "obsidian-vault"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "docs",
          + "obsidian",
          + "vault",
        ]
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.openai-generate-pr-description.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Generate Pull Request description with OpenAI." -> null
      - etag                        = "W/\"e342111aff10457aa57ab13abe936a2f368aed1fec53e8f2868e7bd71c206687\"" -> null
      - full_name                   = "tqer39/openai-generate-pr-description" -> null
      - git_clone_url               = "git://github.com/tqer39/openai-generate-pr-description.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/openai-generate-pr-description" -> null
      - http_clone_url              = "https://github.com/tqer39/openai-generate-pr-description.git" -> null
      - id                          = "openai-generate-pr-description" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "openai-generate-pr-description" -> null
      - node_id                     = "R_kgDONJWZhA" -> null
      - primary_language            = "Python" -> null
      - private                     = false -> null
      - repo_id                     = 882219396 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/openai-generate-pr-description.git" -> null
      - svn_url                     = "https://github.com/tqer39/openai-generate-pr-description" -> null
      - topics                      = [
          - "openai",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }
    }

  # module.openai-generate-pr-description.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Generate Pull Request description with OpenAI."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "openai-generate-pr-description"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "openai",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.private-dotfiles.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "My private dotfiles repository" -> null
      - etag                        = "W/\"61d6b8c67af8db0d3c31dc1e9f2703f21490ed01c87876ccfb119d9cbe2854f4\"" -> null
      - full_name                   = "tqer39/private-dotfiles" -> null
      - git_clone_url               = "git://github.com/tqer39/private-dotfiles.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/private-dotfiles" -> null
      - http_clone_url              = "https://github.com/tqer39/private-dotfiles.git" -> null
      - id                          = "private-dotfiles" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "private-dotfiles" -> null
      - node_id                     = "R_kgDOOy6VZw" -> null
      - private                     = true -> null
      - repo_id                     = 992908647 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/private-dotfiles.git" -> null
      - svn_url                     = "https://github.com/tqer39/private-dotfiles" -> null
      - topics                      = [] -> null
      - visibility                  = "private" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (2 unchanged attributes hidden)
    }

  # module.private-dotfiles.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "My private dotfiles repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "private-dotfiles"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.renovate-config.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Renovate Configuration." -> null
      - etag                        = "W/\"71ca2700eac896c6dd82636b87f644a7ce004e26723b46f724bab037d4b713ca\"" -> null
      - full_name                   = "tqer39/renovate-config" -> null
      - git_clone_url               = "git://github.com/tqer39/renovate-config.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/renovate-config" -> null
      - http_clone_url              = "https://github.com/tqer39/renovate-config.git" -> null
      - id                          = "renovate-config" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "renovate-config" -> null
      - node_id                     = "R_kgDOH2quSQ" -> null
      - private                     = false -> null
      - repo_id                     = 527085129 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/renovate-config.git" -> null
      - svn_url                     = "https://github.com/tqer39/renovate-config" -> null
      - topics                      = [
          - "renovate",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (2 unchanged attributes hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.renovate-config.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Renovate Configuration."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "renovate-config"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "renovate",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.terraform-aws.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Configure AWS resources with Terraform." -> null
      - etag                        = "W/\"0cfeeb5ea218d09edce2d739dc4e24914d886d6646c10b467fbb1ffd6fba5155\"" -> null
      - full_name                   = "tqer39/terraform-aws" -> null
      - git_clone_url               = "git://github.com/tqer39/terraform-aws.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/terraform-aws" -> null
      - http_clone_url              = "https://github.com/tqer39/terraform-aws.git" -> null
      - id                          = "terraform-aws" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-aws" -> null
      - node_id                     = "R_kgDOHQj_NQ" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 487128885 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/terraform-aws.git" -> null
      - svn_url                     = "https://github.com/tqer39/terraform-aws" -> null
      - topics                      = [
          - "aws",
          - "terraform",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.terraform-aws.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Configure AWS resources with Terraform."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-aws"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "aws",
          + "terraform",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.terraform-github.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Configure GitHub resources with Terraform." -> null
      - etag                        = "W/\"c9f7a97c69bdca860742c31d3d63ecba3ed87cc311cd87bd7bf08253632e32c5\"" -> null
      - full_name                   = "tqer39/terraform-github" -> null
      - git_clone_url               = "git://github.com/tqer39/terraform-github.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/terraform-github" -> null
      - http_clone_url              = "https://github.com/tqer39/terraform-github.git" -> null
      - id                          = "terraform-github" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-github" -> null
      - node_id                     = "R_kgDOJRL88g" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 622001394 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/terraform-github.git" -> null
      - svn_url                     = "https://github.com/tqer39/terraform-github" -> null
      - topics                      = [
          - "github",
          - "terraform",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.terraform-github.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Configure GitHub resources with Terraform."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-github"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "github",
          + "terraform",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.terraform-vercel.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "Configure Vercel resources with Terraform." -> null
      - etag                        = "W/\"5e7d12d634104e3186746cd41584f58706480492fba5c1bb03f1f32e318c0d2e\"" -> null
      - full_name                   = "tqer39/terraform-vercel" -> null
      - git_clone_url               = "git://github.com/tqer39/terraform-vercel.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/terraform-vercel" -> null
      - http_clone_url              = "https://github.com/tqer39/terraform-vercel.git" -> null
      - id                          = "terraform-vercel" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-vercel" -> null
      - node_id                     = "R_kgDOJfzjlw" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 637330327 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/terraform-vercel.git" -> null
      - svn_url                     = "https://github.com/tqer39/terraform-vercel" -> null
      - topics                      = [
          - "terraform",
          - "vercel",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # module.terraform-vercel.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Configure Vercel resources with Terraform."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "terraform-vercel"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "terraform",
          + "vercel",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.time-capsule.github_repository.this will be destroyed
  # (because resource uses count or for_each)
  - resource "github_repository" "this" {
      - allow_auto_merge            = true -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archived                    = false -> null
      - auto_init                   = true -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "A service that sends account information to a trusted person when you pass away" -> null
      - etag                        = "W/\"b795e2cc10c9a6b83db4b164c103e5e9a45720b8a300ba698899605ae973bb4c\"" -> null
      - full_name                   = "tqer39/time-capsule" -> null
      - git_clone_url               = "git://github.com/tqer39/time-capsule.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/tqer39/time-capsule" -> null
      - http_clone_url              = "https://github.com/tqer39/time-capsule.git" -> null
      - id                          = "time-capsule" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "time-capsule" -> null
      - node_id                     = "R_kgDOLknAPA" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 776585276 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:tqer39/time-capsule.git" -> null
      - svn_url                     = "https://github.com/tqer39/time-capsule" -> null
      - topics                      = [
          - "nextjs",
          - "time-capsule",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "enabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "enabled" -> null
            }
        }
    }

  # module.time-capsule.github_repository.this[0] will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "A service that sends account information to a trusted person when you pass away"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "time-capsule"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "nextjs",
          + "time-capsule",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.tqer39.github_repository.this has moved to module.tqer39.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "tqer39"
        name                        = "tqer39"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.update-license-year.github_repository.this has moved to module.update-license-year.github_repository.this[0]
    resource "github_repository" "this" {
        id                          = "update-license-year"
        name                        = "update-license-year"
        # (36 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 14 to add, 0 to change, 11 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-github","PRNumber":1348,"Program":"tfcmt","SHA1":"d51514c8817bd51925eea1553e74d9fa7a1b3609","Target":"repository","Vars":{},"WorkflowName":"Terraform - GitHub"} -->